#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=0be0212a-cd08-4438-b813-c37602958c13]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=6064bcea-1e5a-4b90-afff-15e0a6164604]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=41ba8e6d-87ff-41ae-a13c-42b0ccc34c80]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=430f6a30-06b4-4503-8a35-7c0549bdc57c]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=b4c492dd-29ad-4eff-9f6a-6199e40d4489]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=4c2dec25-f5f2-4a0c-961b-001a78eb382c]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=869066b3-22b5-4fa4-80bd-1258571a028d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=ed886bac-86bd-453d-8328-bd0d19c78714]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=b66d3197-704f-46c6-9aac-498eb83c3497]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=9dfb53c4-d85d-450f-a868-d91a75432aa7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=5747366e-8ccf-461e-a323-660f7806c4ed]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=a4a423b9-bf19-4e74-a03f-fd74379402d7]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=1bc637a7-aadc-475a-9a82-9640503ac379]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=67727a7d-7e9e-4e38-b009-72294b87f8ed]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=8cc66266-e7c9-49d0-9094-db8880d49bc5]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a06a71d0-b878-4955-b563-e3d4e7f942a8]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=03c09f53-d470-4e1d-a117-66bc23ab2338]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=bb8447bb-01b4-4583-aa43-68086c7c662f]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=2eee1419-877d-4640-9246-2f3b7c40a790]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=5e8e3dca-1c88-4b48-abe3-48e2d341d803]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5f634583-cd9a-4e68-a81b-8874cbdc21ff/2eee1419-877d-4640-9246-2f3b7c40a790]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/4c2dec25-f5f2-4a0c-961b-001a78eb382c]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=01d9c4a4-5813-46dd-b71f-7502501c2b22]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=92b708c6-23f9-4fe4-bc05-9308f8a944c7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=122c16c9-bd55-4ad4-bd50-3fe049d33ed9]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/869066b3-22b5-4fa4-80bd-1258571a028d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b4f70925-3cc5-4a2e-9506-389b3ab45db1/01d9c4a4-5813-46dd-b71f-7502501c2b22]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6064bcea-1e5a-4b90-afff-15e0a6164604]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=947e9768-f5db-4a66-b8f6-e5691ab74c8f/5e8e3dca-1c88-4b48-abe3-48e2d341d803]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/0be0212a-cd08-4438-b813-c37602958c13]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b5719a55-48d6-47ae-bd28-97879d9c7f2d/bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=81be272f-96a6-432b-9ec3-a1c48fc74e6f]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=00e0874c-c611-4b28-ae94-39517625830c]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=9fd64b5f-8912-4aeb-bad2-c19439762f4d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/5747366e-8ccf-461e-a323-660f7806c4ed]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f745bfb-33c1-44ae-a206-1aef4cd962b9/122c16c9-bd55-4ad4-bd50-3fe049d33ed9]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6a4a0757-206a-465d-a34e-a2bb1f228cbc/92b708c6-23f9-4fe4-bc05-9308f8a944c7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a4a423b9-bf19-4e74-a03f-fd74379402d7]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=746c937d-4492-4c3e-91e3-7dc355a5a701/81be272f-96a6-432b-9ec3-a1c48fc74e6f]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/8cc66266-e7c9-49d0-9094-db8880d49bc5]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=112f8ca9-91c6-4be2-ab3e-4278e8fdaf21/00e0874c-c611-4b28-ae94-39517625830c]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a06a71d0-b878-4955-b563-e3d4e7f942a8]
module.keycloak_prod.module.master_viewer_role.keycloak_openid_client.viewer_service_account: Refreshing state... [id=1372ca4a-5b5d-4bd7-acc0-95f944fdc3af]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4d005c17-fe3a-412a-afc3-63b3f60e39c8/9fd64b5f-8912-4aeb-bad2-c19439762f4d]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/67727a7d-7e9e-4e38-b009-72294b87f8ed]
module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account: Refreshing state... [id=5e5ed0d5-0f42-4ec6-9a19-119a324ba051]
module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer: Refreshing state... [id=e1223314-b5f9-42d5-9890-ce70b83af679]
module.keycloak_test.module.master_viewer_role.keycloak_openid_client.viewer_service_account: Refreshing state... [id=e0fbbca7-b3e6-42c2-8185-36287fe2611e]
module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role: Refreshing state... [id=bfcbdf04-56e1-49ef-8d50-99cfb2fa18cb/e1223314-b5f9-42d5-9890-ce70b83af679]
module.keycloak_prod.module.master_viewer_role.keycloak_role.viewer: Refreshing state... [id=387d277b-9e28-45c8-9657-608ec57b7c72]
module.keycloak_prod.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role: Refreshing state... [id=afef0d47-3467-475d-b712-f79fec7b6d00/387d277b-9e28-45c8-9657-608ec57b7c72]
module.keycloak_test.module.master_viewer_role.keycloak_role.viewer: Refreshing state... [id=3f0e8534-ecec-4da5-95a0-f775fa686bf5]
module.keycloak_test.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role: Refreshing state... [id=060b3246-ac52-40e2-b14e-1befc9f55750/3f0e8534-ecec-4da5-95a0-f775fa686bf5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "bcparks-service-transformation Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "zorin-dev-custom-realm-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "94073b58-9c32-409d-a440-0ded7d3a56de" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "57a258b2-41cb-4b89-8ed9-21f6fbdcfb1e" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "632d8767-da11-4146-8fd2-58d38d451415" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "f82c59e9-b28c-4062-9153-11389ee110d7" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "05a865c2-0baf-434b-8bb5-26da5f719eb8" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "bc02ef72-d763-4c4b-8419-b08c55caa0c0" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "4345faf0-5194-42ea-88da-17109ea0cc6a" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["zorin-dev-custom-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer will be updated in-place
  ~ resource "keycloak_role" "viewer" {
      ~ composite_roles = [
          - "05a865c2-0baf-434b-8bb5-26da5f719eb8",
          - "4345faf0-5194-42ea-88da-17109ea0cc6a",
          - "57a258b2-41cb-4b89-8ed9-21f6fbdcfb1e",
          - "632d8767-da11-4146-8fd2-58d38d451415",
          - "94073b58-9c32-409d-a440-0ded7d3a56de",
          - "f82c59e9-b28c-4062-9153-11389ee110d7",
        ] -> (known after apply)
        id              = "e1223314-b5f9-42d5-9890-ce70b83af679"
        name            = "viewer-custom-realms"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "zorin-dev-custom-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "zorin-dev-custom-realm-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "zorin-dev-custom-realm Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "zorin-dev-custom-realm-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "zorin-dev-custom-realm-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "zorin-dev-custom-realm-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "zorin-dev-custom-realm-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 16 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*